Revit 2027 API
ScheduleFieldId.Inequality Operator
Determines whether two ScheduleFieldId are different.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator !=(
	ScheduleFieldId first,
	ScheduleFieldId second
)
Public Shared Operator <> (
	first As ScheduleFieldId,
	second As ScheduleFieldId
) As Boolean
public:
static bool operator !=(
	ScheduleFieldId^ first,
	ScheduleFieldId^ second
)
static let inline (<>)
        first : ScheduleFieldId *
        second : ScheduleFieldId  : bool
Parameters
first ScheduleFieldId
The first ScheduleFieldId.
second ScheduleFieldId
The second ScheduleFieldId.
Return Value
Boolean
True if the ScheduleFieldId are different, otherwise false.
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace